[
  {
    "name": "HTwins Central",
    "invite": "discord.gg/Qct6pAM",
    "rules": [
      {
        "text": "Be respectful",
        "rating": 0,
        "why": "I was going to rate this warning (since respect is a 2 way street), but the rules say constructive criticism is fine, so i have nothing against."
      },
      {
        "text": "Don't swear at anyone or excessively use heavy swears.",
        "rating": 0,
        "why": "I dont see a reason to not block this."
      },
      {
        "text": "Stay on topic.",
        "rating": 1,
        "why": "What if someone doesnt know where to put something, because there are multiple channels that could be fine?"
      },
      {
        "text": "There's a memes channel. There's an ads channel.",
        "rating": 0,
        "why": "Brilliant way to move spam to a different channel."
      },
      {
        "text": "Check for spoilers!",
        "rating": 0,
        "why": "Also a brilliant way to block them!"
      }
    ],
    "summary": "This server was incredibly close to being perfect. The tragedy of the 'stay on topic' rule was virtually the only thing of the 5 that broke the perfect server. I should mention that there are many more rules, but overall this server is one of the best and most unfortunate of all time.",
    "lastUpdate": "2025-01-07"
  },
  {
    "name": "Flipper devices",
    "invite": "discord.gg/uyZHXeD2kr",
    "rules": [
      {
        "text": "Respect",
        "rating": 1,
        "why": "Respect is a 2 way street, sadly."
      },
      {
        "text": "Moderation",
        "rating": 1,
        "why": "I have zero clue what they mean by that, however the 'discuss in private' part is scary because that way accountability cannot be enforced."
      },
      {
        "text": "Language.",
        "rating": 0,
        "why": "そうですね、突然誰かが日本語で話しているのを見たくありません。"
      },
      {
        "text": "Content",
        "rating": 1,
        "why": "Keeping conversations appropriate is ambiguous. Also 'relevant channel' what if there is no relevant channel or there are multiple?"
      },
      {
        "text": "Discrimination",
        "rating": 2,
        "why": "The fact this is a zero tolerance rule already grants a severe tier. Sure, racism, trans and the relevant things are never good and the only reason this rule is not critical."
      },
      {
        "text": "Spam",
        "rating": 2,
        "why": "Barely got onto severe. Firstly, there is the option of the spam channel. Secondly, and the only reson this got severe, is 'any other content deemed inappropriate by our moderation team.'."
      },
      {
        "text": "Profiles",
        "rating": 0,
        "why": "I'm not sure, but this seems fine, and i have no reason to reduce this."
      },
      {
        "text": "Firmware Forks",
        "rating": 0,
        "why": "They only said on illegal things, which i feel like is the only reason why i am not giving it a worse rating."
      },
      {
        "text": "Questions",
        "rating": 1,
        "why": "What if someone forgets to do it?"
      },
      {
        "text": "Sales",
        "rating": 2,
        "why": "On top of reducing sales of your own product, what if the flipper goes out of stock and need a very specific link to get one?"
      },
      {
        "text": "Legality",
        "rating": 3,
        "why": "Legality is a thing. The fact this includes trolling and pranks is extremely serious. On top of staff also mentioning 'inappropriate' things ambiguily."
      }
    ],
    "summary": "This server, intended to be a discussion for the popular product flipper zero, has quite a few rules that are quite strict, but in particular, the legality rule and how they sneak in harmless things like trolling make this server a very big red flag.",
    "lastUpdate": "2025-01-07"
  },
  {
    "name": "Mulpan's Request server",
    "invite": "//discord.gg/KF3VCeuU",
    "rules": [
      {
        "text": "Send me level ID",
        "rating": 0,
        "why": "This is a GD request server, so this is expected."
      },
      {
        "text": "Do NOT send URL (Links)",
        "rating": 0,
        "why": "Perfectly reasonable, expecially given the description."
      },
      {
        "text": "Keep your message SHORT",
        "rating": 0,
        "why": "Mulpan does not say the reason, however, maybe it is understandable if he wants to not scroll 30 rows or find the ID themselves."
      },
      {
        "text": "AVOID duplicate request, AVOID joke requests",
        "rating": 0,
        "why": "Very clear rule, and 'it makes me tired' is honestly kinda funny but respectable."
      },
      {
        "text": "NO general conversation",
        "rating": 1,
        "why": "This could have killed the opportunity to actually talk with fans (they do not have a no-requests server, so if you're reading, consider expanding it!)"
      },
      {
        "text": "Do NOT mention users (Including Mulpan)",
        "rating": 1,
        "why": "The answer to that question (Mentioning users are not necessary in request server, right?), almost. If multiple people made a level, I'd argue the other should be mentioned. But the 'dont ping me, i am unbeatable' is funny."
      },
      {
        "text": "Keep our server and server members SAFE",
        "rating": 0,
        "why": "Yeah safety is paramount."
      }
    ],
    "summary": "This server is almost perfect, but should be expanded (like pastabox). Mulpan said they have no reason to make this official. Oh well.",
    "lastUpdate": "2025-01-07"
  },
  {
    "name": "Minekeep",
    "invite": "discord.com/invite/minekeep",
    "rules": [
      {
        "text": "Be respectful",
        "rating": 0,
        "why": "I almost wanted to give it a warning, but 'treat others the way you want to' is a brilliant simplification."
      },
      {
        "text": "No spamming",
        "rating": 0,
        "why": "Yeah i dont see anything against this."
      },
        {
        "text": "No NSFW",
        "rating": 1,
        "why": "Excellent rule, apart the ending (staff reserve the right to ban on the spot)."
      },
      {
        "text": "No violence",
        "rating": 0,
        "why": "I never even tought of such a rule but yeah safe to ban it."
      },
      {
        "text": "No Fraudulent Activity",
        "rating": 1,
        "why": "Excellent rule! If only hackers arent around and someone could be hacked."
      },
      {
        "text": "Advertising",
        "rating": 1,
        "why": "They clearly tought about this, but just #server-ads isnt enough."
      },
      {
        "text": "No Direct or Indirect Threats",
        "rating": 0,
        "why": "I dont allow threats either."
      },
      {
        "text": "English Only",
        "rating": 0,
        "why": "そうですね、突然誰かが日本語で話しているのを見たくありません。"
      },
      {
        "text": "Follow the Discord Guidelines and TOS",
        "rating": 0,
        "why": "Yeah if this rule is not there your server might be banned, so..."
      },
      {
        "text": "Staff have the final say in all matters, do not argue with them. If you believe you are being treated unfairly, create a ticket.",
        "rating": 3,
        "why": "This very hidden rule is basically totalitarianism. A ticket can be easily ignored. The fact this rule is also so well hidden makes this expecially a red flag."
      }
    ],
    "summary": "While the presented rules make this a fairly OK, if upgradeable, server, the final rule, expecially because its so well hidden, is an incredibly serious red flag.",
    "lastUpdate": "2025-01-07"
  }
]
